app/controllers/farms_controller.rb

SELECT "farms".* FROM "farms"
---
  def index
    @farms = Farm.all

SELECT "farms".* FROM "farms" WHERE "farms"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_farm
      @farm = Farm.find(params[:id])