app/controllers/foods_controller.rb

  def create
    @food = Food.new(food_params)
    @food.user = @current_user

    if @food.save
---
INSERT INTO "foods" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Blueberry"], ["user_id", 8], ["created_at", "2020-08-13 15:34:41.534790"], ["updated_at", "2020-08-13 15:34:41.534790"]]

  def update
    if @food.update(food_params)
---
UPDATE "foods" SET "name" = $1, "updated_at" = $2 WHERE "foods"."id" = $3  [["name", "Lettuces"], ["updated_at", "2020-08-13 21:48:09.978300"], ["id", 11]]

  def destroy
    @food.destroy
---
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 5]]

  def add_farm
    @food = Food.find(params[:id])
    @farm = Farm.find(params[:farm_id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "farms".* FROM "farms" WHERE "farms"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]